<a href="https://colab.research.google.com/github/ArtikaYuzuf/-Art-Yusuf/blob/master/Linear%20Regression%20from%20scratch%20without%20sklearn.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import numpy as np
import pandas as pd

In [5]:
# Import Dataset
df = pd.read_csv('https://raw.githubusercontent.com/rc-dbe/bigdatacertification/master/dataset/Salary_Data.csv')

In [6]:
# Prints 10 first Row
df.head(10)

   YearsExperience   Salary
0              1.1  39343.0
1              1.3  46205.0
2              1.5  37731.0
3              2.0  43525.0
4              2.2  39891.0
5              2.9  56642.0
6              3.0  60150.0
7              3.2  54445.0
8              3.2  64445.0
9              3.7  57189.0

In [7]:
mean_yoe = sum(df['YearsExperience']) / float(len(df['YearsExperience']))
mean_yoe

5.3133333333333335

In [8]:
mean_salary = sum(df['Salary']) / float(len(df['Salary']))
mean_salary

76003.0

In [9]:
def variance(values, mean): 
  return sum([(val-mean)**2 for val in values])

In [10]:
def covariance(yearsexperience, mean_yoe, salary, mean_salary):
  covariance = 0.0
  for r in range(len(yearsexperience)):
    covariance = covariance + (yearsexperience[r] - mean_yoe)*(salary[r] - mean_salary)
    return covariance

In [11]:
variance_yoe, variance_salary = variance(df['YearsExperience'], mean_yoe), variance(df['Salary'], mean_salary)
variance_yoe, variance_salary

(233.55466666666663, 21794977852.0)

In [12]:
covariance_yoe_salary = covariance(df['YearsExperience'],mean_yoe,df['Salary'],mean_salary)
covariance_yoe_salary

154460.8

In [13]:
m = covariance_yoe_salary/ variance_yoe
c = mean_salary - m* mean_yoe
m,c

(661.3475217793408, 72489.04016761243)

In [14]:
salary = 661 * 4 + 72489
salary

75133